import z from "zod";
import { splitName } from "./string";

export const pozovTemplateDataSchema = z.object({
  "дата реєстрації шлюбу": z.string(),
  "орган який зареєстрував (орудний відмінок)": z.string(),
  "номер актового запису": z.string(),

  "чи є діти": z.boolean(),

  "з ким проживають діти": z.enum(["позивач", "відповідач"]),
  "з ким будуть проживати діти": z.enum([
    "позивач",
    "відповідач",
    "питання буде вирішуватись",
  ]),

  діти: z
    .array(
      z.object({
        "ПІБ (називний відмінок)": z.string(),
        "ПІБ (знахідний відмінок)": z.string(),
        ДН: z.string(),
      }),
    )
    .optional(),

  "причина розпаду сім'ї": z.string(),
  "дата припинення шлюбних стосунків (родовий відмінок)": z.string(),
  "чи є спір про розподіл майна": z.boolean(),
  "ПІБ позивача": z.string(),
  "ПІБ Відповідача": z.string(),

  "ПІБ позивача (орудний відмінок)": z.string(),
  "ПІБ Відповідача (орудний відмінок)": z.string(),

  "чи залишає позивач прізвище (шлюбне)": z.enum(["так", "ні", "не брав"]),
  "дошлюбне прізвище Позивача": z.string(),
});

export type PozovTemplateData = z.infer<typeof pozovTemplateDataSchema>;

export function generatePozovText(data: PozovTemplateData) {
  const lastName = splitName(data["ПІБ позивача"]).lastName;

  const surnameLine =
    data["чи залишає позивач прізвище (шлюбне)"] == "так"
      ? `/tПісля розірвання шлюбу залишити  Позивачу прізвище «${lastName}».`
      : data["чи залишає позивач прізвище (шлюбне)"] == "ні"
        ? `/tПісля розірвання шлюбу повернути Позивачу прізвище «${data["дошлюбне прізвище Позивача"]}».`
        : "";

  return `
/tСторони перебувають у шлюбі, який зареєстрований ${data["дата реєстрації шлюбу"]} року ${data["орган який зареєстрував (орудний відмінок)"]}, актовий запис №${data["номер актового запису"]}.
${generateChildrenLine(data)}
/t Причиною розпаду сім\`ї те, що між подружжям відсутнє взаєморозуміння, тому як вони мають різні характери та погляди на життя, із-за чого постійно виникають непорозуміння, сварки. Сторони втратили почуття любові та взаємоповаги один до одного.
/t Шлюбно-сімейні відносини між Сторонами припинені з ${data["дата припинення шлюбних стосунків (родовий відмінок)"]}. Позивач вважає, що сім\`я розпалася остаточно та поновлена бути не може.
${data["чи є спір про розподіл майна"] ? "/tСпору про сумісно нажите  майно між подружжям на даний час не має." : "/tСпір про розподіл сумісно нажитого майна між подружжям буде вирішуватись в окремому порядку."}
/t Відповідно до статті 110 Сімейного Кодексу України позов про розірвання шлюбу може бути пред\`явлений одним з подружжя.
/t Відповідно до частини  другої цієї статті суд постановляє рішення про розірвання шлюбу, якщо буде встановлено, що подальше спільне життя подружжя і збереження шлюбу суперечило б інтересам одного з них.
/tДля того, щоб розірвання шлюбу здійснювалося за правилами спрощеного позовного провадження, потрібно  подати клопотання у письмовій формі одночасно із поданням позовної заяви, або таке клопотання може міститься у позовній заяві відповідно  до ст. 276 ЦПК України.
/tВсі оригінали письмових доказів, копії яких додано до позовної заяви знаходяться у Позивача.
/tСума судових витрат складає суму судового збору 1331 грн. 20 коп.
/tПозивач підтверджує, що нею не подано іншого  позову до цього ж Відповідача з тим самим предметом  та з тих самих підстав.
/tНа підставі викладеного, керуючись ст.ст. 104, 105, ч.2 ст. 110, ст. 112 СК України,
/t/cПРОШУ:
/tПрийняти позовну заяву до розгляду та відкрити провадження у справі.
/tРозглянути справу про розірвання шлюбу між Позивачем та Відповідачем у порядку спрощеного провадження без виклику сторін.
/tРозірвати шлюб між ${data["ПІБ позивача (орудний відмінок)"]} та ${data["ПІБ Відповідача (орудний відмінок)"]}, зареєстрований ${data["дата реєстрації шлюбу"]} року ${data["орган який зареєстрував (орудний відмінок)"]}, актовий запис №${data["номер актового запису"]}.
${surnameLine}
`;
}

const davVidCounting = [
  "одну",
  "двоє",
  "троє",
  "четверо",
  "п'ятеро",
  "шестеро",
];

function generateChildrenLine(data: PozovTemplateData) {
  const children = data["діти"];

  if (!data["чи є діти"] || !children || children?.length == 0)
    return "/tСторони не мають від шлюбу неповнолітніх дітей, однак відповідач заперечує розривати шлюб в органах РАЦС.";

  const childrenAmountText =
    children?.length < 6
      ? `${davVidCounting[children.length - 1]} ${children.length == 1 ? "дитину" : "дітей"}`
      : `${children.length} дітей`;

  if (data["з ким будуть проживати діти"] == "питання буде вирішуватись")
    return `
/t Від шлюбу сторони мають ${childrenAmountText}: ${children.map((ch) => `${ch["ПІБ (знахідний відмінок)"]} ${ch["ДН"]} року народження`).join(", ")}.
/t ${children.length > 1 ? "Неповнолітні діти" : "Неповнолітня дитина"}: ${children.map((ch) => `${ch["ПІБ (називний відмінок)"]} ${ch["ДН"]} року народження`).join(", ")}, прожива${children.length == 1 ? "є" : "ють"} із ${data["з ким проживають діти"]}ем, питання проживання буде вирішуватись за домовленістю Сторін.
`;

  return `
/t Від шлюбу сторони мають ${childrenAmountText}: ${children.map((ch) => `${ch["ПІБ (знахідний відмінок)"]} ${ch["ДН"]} року народження`).join(", ")}.
/t ${children.length > 1 ? "Неповнолітні діти" : "Неповнолітня дитина"}: ${children.map((ch) => `${ch["ПІБ (називний відмінок)"]} ${ch["ДН"]} року народження`).join(", ")}, прожива${children.length == 1 ? "є" : "ють"} із ${data["з ким проживають діти"]}ем і буд${children.length == 1 ? "е" : "уть"} проживати з ${data["з ким будуть проживати діти"]}ем після розірвання шлюбу.
`;
}
