import { z } from "zod";

export const childSchema = z.object({
    ПІБ: z.string(),
    ДН: z.string(),
    "з ким проживає": z.string(),
    "з ким буде проживати після шлюбу": z.string(),
});

export const dataSchema = z.object({
    "дата реєстрації шлюбу": z.string(),
    "орган який зареєстрував": z.string(),
    "номер актового запису": z.string(),
    "чи є діти": z.boolean(),
    діти: z.array(childSchema).optional(),
    "причина розпаду сім'ї": z.string(),
    "скільки часу не підтримують шлюбні відносини": z.string(),
    "чи є спір про розподіл майна": z.boolean(),
    "ПІБ позивача": z.string(),
    "ПІБ Відповідача": z.string(),
    "чи залишає позивач прізвище (шлюбне)": z.boolean(),
    "дошлюбне прізвище Позивача": z.string(),
});

export type ExtractData = z.infer<typeof extractDataSchema>;

export const extractDataSchema = z.object({
    success: z.boolean(),
    message: z.string(),
    data: dataSchema.optional(),
});

export const extractionPrompt = `
# Витягування даних
Витягни з прикріплених документів/фотографій/таблиці данні,
для створення позовної заяви приорітезуй опитувальник для отримання данних.


ВАЖЛИВО:
Намагайся не вигадувати нічого та попереджай користувача,
якщо відносишся до чогось скептично!

# Формат Даних

ДН - дата народження.
ПІБ - ЗАВЖДИ У ФОРМАТІ Прізвище Ім'я По Батькові (ВАЖЛИВО!!! ЗАВЖДИ ПОВНИЙ ПІБ, ДЕ КОЖНЕ ЗНАЧЕННЯ БЕРЕТЬСЯ З ВІДПОВІДНОЇ СТРОФИ)

Будь які дати у форматі "ЧЧ місяць РРРР" (слово року не треба)

# Формат полей

діти."ПІБ (називний відмінок)" :  ПІБ хто? що? наприклад "Ткаченко Валентина Дмитрівна"
діти."ПІБ (знахідний відмінок)" : ПІБ кого? що? наприклад "Ткаченко Валентину Дмитрівну"
діти."з ким проживають" : вказано у формі, типи відповідей також вказані

це поле рахуй з вказаної відповіді в опитувальнику від сьогоднішньої дати. Сьогодні ${new Date().toLocaleDateString("uk-UA")}.

# Місце реєстрації та актовий запис

Місце реєстрації повинно бути повним (ВАЖЛИВО: ЦЕ ПОЛЕ ПОВИННО БУТИ ТАКИМ САМИМ ЯК СТРОФА МІСЦЕ РЕЄСТРАЦІЇ,
ТАКОЖ ВАЖЛИВО ЩО ІНОДІ ІСНУЄ ДВІ РІЗНІ СТРОФИ МІСЦЕ РЕЄСТРАЦІЇ ТА МІСЦЕ ВИДАЧІ ВИКОРИСТОВУЙ ЗАВЖДИ ДРУГУ)

Актовий запис також бери з відповідної строфи в свідоцтві про шлюб

Завжди дивись у опитувальник для цього питання, відповідь на це питання завжди знаходиться під питанням.
ЗАВЖДИ ПЕРЕВІРЯЙ ЧИ ХОЧЕ КЛІЄНТ ЗАЛИШИТИ ПРІЗВИЩЕ, ЯКЩО У ПОЛІ "Якщо брали прізвище чоловіка, чи плануєте його залишати?"
Стоїть так, то у JSON теж відповідай "так".

# Додаткові ресурси

## Відмінки в Українські мові
Називний (Н.в.) — Хто? Що? (початкова форма) — школа, батько.
Родовий (Р.в.) — Кого? Чого? — школи, батька.
Давальний (Д.в.) — Кому? Чому? — школі, батькові/батьку.
Знахідний (Зн.в.) — Кого? Що? — школу, батька.
Орудний (Ор.в.) — Ким? Чим? — школою, батьком.
Місцевий (М.в.) — На кому? На чому? (завжди з прийменником) — на школі, на батькові.
Кличний (Кл.в.) — використовується для звертання — школо!, батьку!.
`;
