import { z } from "zod";
import { zodToGemini } from "../gemini-zod";

export const childSchema = z.object({
  ПІБ: z.string(),
  ДН: z.string(),
  "з ким проживає": z.string(),
  "з ким буде проживати після шлюбу": z.string(),
});

export const dataSchema = z.object({
  "дата реєстрації шлюбу": z.string(),
  "орган який зареєстрував": z.string(),
  "номер актового запису": z.string(),
  "чи є діти": z.boolean(),
  діти: z.array(childSchema).optional(),
  "причина розпаду сім'ї": z.string(),
  "скільки часу не підтримують шлюбні відносини": z.string(),
  "чи є спір про розподіл майна": z.boolean(),
  "ПІБ позивача": z.string(),
  "ПІБ Відповідача": z.string(),
  "чи залишає позивач прізвище (шлюбне)": z.boolean(),
  "дошлюбне прізвище Позивача": z.string(),
});

export type ExtractData = z.infer<typeof extractDataSchema>;

export const extractDataSchema = z.object({
  success: z.boolean(),
  message: z.string(),
  data: dataSchema.optional(),
});

export const extractionPrompt = `Витягни з прикріплених документів/фотографій/таблиці данні,
для створення позовної заяви приорітезуй опитувальник для отримання данних.
Напиши коментар до витягнутих данних у message та статус у success.
ДН - дата народження.

Існує два види (поле type) заяви "розлучення" | "аліменти (Судовий наказ)", тип заяви тобі вже дається.

Місце реєстрації повинно бути повним

ВАЖЛИВО:
Намагайся не вигадувати нічого та попереджай користувача,
якщо відносишся до чогось скептично!

Візьми данні скільки часу не підтримують шлюбні відносини з опитувальника.

Також у message вкажи тип заяви (type).

Найчастіше Позивач залишає прізвище чоловіка, якщо все таки змінює прізвище повідом у message.
Завжди дивись у опитувальник для цього питання, відповідь на це питання завжди знаходиться під питанням.
ЗАВЖДИ ПЕРЕВІРЯЙ ЧИ ХОЧЕ КЛІЄНТ ЗАЛИШИТИ ПРІЗВИЩЕ, ЯКЩО У ПОЛІ "Якщо брали прізвище чоловіка, чи плануєте його залишати?"
Стоїть так, то у JSON теж відповідай true.

У message не пиши які данні витягнуті якщо це не критично, тому що користувач бачить їх у data
намагайся зробити message лаконічним з чимось важливим.
`;
