import { GenerateContentConfig, MediaResolution } from "@google/genai";

import { z } from "zod";
import { zodToGemini } from "../gemini-zod";

export const childSchema = z.object({
  ПІБ: z.string(),
  ДН: z.string(),
  "з ким проживає": z.string(),
  "з ким буде проживати після шлюбу": z.string(),
});

export const dataSchema = z.object({
  "дата реєстрації шлюбу": z.string(),
  "орган який зареєстрував": z.string(),
  "номер актового запису": z.string(),
  "чи є діти": z.boolean(),
  діти: z.array(childSchema).optional(),
  "причина розпаду сім'ї": z.string(),
  "скільки часу не підтримують шлюбні відносини": z.string(),
  "чи є спір про розподіл майна": z.boolean(),
  "ПІБ позивача": z.string(),
  "ПІБ Відповідача": z.string(),
  "чи залишає позивач прізвище (шлюбне)": z.boolean(),
  "дошлюбне прізвище Позивача": z.string(),
});

export const extractDataSchema = z.object({
  success: z.boolean(),
  message: z.string(),
  data: dataSchema.optional(),
  type: z.enum(["розлучення", "аліменти (Судовий наказ)"]),
});

export type ExtractData = z.infer<typeof extractDataSchema>;

export const extractPozovConfig: GenerateContentConfig = {
  thinkingConfig: {
    thinkingBudget: -1,
  },
  mediaResolution: MediaResolution.MEDIA_RESOLUTION_HIGH,
  responseMimeType: "application/json",
  systemInstruction: [
    {
      text: `Витягни з прикріплених документів/фотографій/таблиці данні, 
для створення позовної заяви приорітезуй опитувальник для отримання данних. 
Напиши коментар до витягнутих данних у message та статус у success.
ДН - дата народження.

Існує два види (поле type) заяви "розлучення" | "аліменти (Судовий наказ)", тип заяви тобі вже дається.

Місце реєстрації повинно бути повним

ВАЖЛИВО:
Намагайся не вигадувати нічого та попереджай користувача,
якщо відносишся до чогось скептично!

Візьми данні скільки часу не підтримують шлюбні відносини з опитувальника.

Також у message вкажи тип заяви (type).

Найчастіше Позивач залишає прізвище чоловіка, якщо все таки змінює прізвище повідом у message.
Завжди дивись у опитувальник для цього питання, відповідь на це питання завжди знаходиться під питанням.
ЗАВЖДИ ПЕРЕВІРЯЙ ЧИ ХОЧЕ КЛІЄНТ ЗАЛИШИТИ ПРІЗВИЩЕ, ЯКЩО У ПОЛІ "Якщо брали прізвище чоловіка, чи плануєте його залишати?" 
Стоїть так, то у JSON теж відповідай true.

У message не пиши які данні витягнуті якщо це не критично, тому що користувач бачить їх у data
намагайся зробити message лаконічним з чимось важливим.
`,
    },
  ],
  responseSchema: zodToGemini(extractDataSchema),
};

export const generatePozovConfig: GenerateContentConfig = {
  thinkingConfig: {
    thinkingBudget: -1,
  },
  mediaResolution: MediaResolution.MEDIA_RESOLUTION_HIGH,
  systemInstruction: [
    {
      text: `
Створи документ позовної заяви використовуючи данні користувача подані у JSON.
Видали ТОЛЬКИ текст позовної заяви, без JSON, без markdown, без будь-яких додаткових символів чи форматування.
Використовуй символи *якась фраза* для позначення важливих даних.
/t означає новий абзац, /c означає вирівнювання по центру.

ДН - дата народження
Сьогодні ${new Date().toLocaleString("uk-UA")}, ЦЕ ВАЖЛИВО!

Позовна заява типу "розлучення" складається так:

/tСторони перебувають у шлюбі, який зареєстрований {дата реєстрації} {повне місце реєстрації (в орудному відмінку)}, актовий запис №{актовий запис}.
{Якщо немає дітей} /tСторони не мають від шлюбу неповнолітніх дітей, однак відповідач заперечує розривати шлюб в органах РАЦС.
{Якщо є діти} /t Від шлюбу сторони мають {одну неповнолітню дитину/{кількість дітей буквами} неповнолітніх дітей}: {Для кожної дитини} {ПІБ дитини} {ДН дитини}.
/t(Неповнолітні діти/Неповнолітня дитина): {для кожної неповнолітньої дитини (повинно бути в одному параграфі)}: {ПІБ дитини} {ДН дитини} народження, прожива(є/ють) із {з ким буде проживати (Позивач/Відповідачем/обома батьками)}
і буд(е/уть) проживати з {з ким буде проживати після розірвання шлюбу.
(Позивачем/Відповідачем/Питання буде вирішуватись за домовленістю сторін (у цьому варіанти не треба писати "І будуть проживати; після розірвання шлюбу у кінці", 
використовуй цей варіант, якщо немає чіткого рішення з ким буде проживати дитина "наприклад у варіанті тиждень зі мною тиждень з батьком"))} після розірвання шлюбу.
/t Причиною розпаду сім\`ї {причина розірвання шлюбу (Завжди пиши "те, що між подружжям відсутнє взаєморозуміння, 
тому як вони мають різні характери та погляди на життя, із-за чого постійно виникають непорозуміння, сварки. 
Сторони втратили почуття любові та взаємоповаги один до одного" але можно додати ще щось з данних)}.
/t Шлюбно-сімейні відносини між Сторонами припинені з {місяць та рік припинення (У НАЗИВНОМУ ВІДМІНКУ)}. Позивач вважає, що сім\`я 
розпалася остаточно та поновлена бути не може.  
/t Відповідно до статті 110 Сімейного Кодексу України позов про розірвання шлюбу може бути пред\`явлений одним з подружжя.
/t Відповідно до частини  другої цієї статті суд постановляє рішення про розірвання шлюбу, якщо буде встановлено, 
що подальше спільне життя подружжя і збереження шлюбу суперечило б інтересам одного з них.
{якщо спору про розподіл майна немає} /tСпору про сумісно нажите  майно між подружжям на даний час не має.
{якщо спір про розподіл майна є} /tСпір про розподіл сумісно нажитого майна між подружжям буде вирішуватись в окремому порядку.
/tДля того, щоб розірвання шлюбу здійснювалося за правилами спрощеного позовного провадження, 
потрібно  подати клопотання у письмовій формі одночасно із поданням позовної заяви, або таке клопотання може міститься
у позовній заяві відповідно  до ст. 276 ЦПК України.
/tВсі оригінали письмових доказів, копії яких додано до позовної заяви знаходяться у Позивача.
/tСума судових витрат складає суму судового збору 1331 грн. 20 коп.
/tПозивач підтверджує, що нею не подано іншого  позову до цього ж Відповідача з тим самим предметом  та з тих самих підстав.
/tНа підставі викладеного, керуючись ст.ст. 104, 105, ч.2 ст. 110, ст. 112 СК України,
/t/cПРОШУ:
/tПрийняти позовну заяву до розгляду та відкрити провадження у справі.
/tРозглянути справу про розірвання шлюбу між Позивачем та Відповідачем у порядку спрощеного провадження без виклику сторін.
/tРозірвати шлюб між {ПІБ Позивача (в орудному відмінку)} та {ПІБ Відповідача (в орудному відмінку)}, зареєстрований {дата реєстрації} {повне місце реєстрації (в орудному відмінку)} актовий запис №{актовий запис}
/t{Якщо Позивач залишає прізвище} Після розірвання шлюбу залишити  позивачу прізвище «{Прізвище позивача}».
/t{Якщо Позивач хоче повернути дошлюбне прізвище} Після розірвання шлюбу повернути Позивачу дошлюбне прізвище «{Дошлюбне прізвище}».

Позовна заява типу "аліменти (Судовий наказ)" складається так:

TODO (ще немає шаблону)

ВАЖЛИВО: Поверни ТОЛЬКО текст позовної заяви, без JSON, без markdown, без зайвих символів. Просто чистий текст документу.

Дотримуйся правил правопису української мови (такі як пунктуація, після кожного речення ставити крапу або правильні відмінювання слів).
`,
    },
  ],
};
